Coles427/WirelessImg/CC3200/main.c
    /* connect to the peer device - Google server */
    lRetVal = sl_Connect(iSockID, ( SlSockAddr_t *)&Addr, iAddrSize);

    if(lRetVal < 0) {
        UART_PRINT("Device couldn't connect to server:");
        UART_PRINT(SERVER_NAME);
        UART_PRINT("\n\r");
        return printErrConvenience("Device couldn't connect to server \n\r", lRetVal);
    }
    else {
        UART_PRINT("Device has connected to the website:");
        UART_PRINT(SERVER_NAME);
        UART_PRINT("\n\r");
    }

    //GPIO_IF_LedOff(MCU_RED_LED_GPIO);
    //GPIO_IF_LedOn(MCU_GREEN_LED_GPIO);
    return iSockID;
}



long printErrConvenience(char * msg, long retVal) {
    UART_PRINT(msg);
    //GPIO_IF_LedOn(MCU_RED_LED_GPIO);
    return retVal;
}



int connectToAccessPoint() {
    long lRetVal = -1;
   // GPIO_IF_LedConfigure(LED1|LED3);

    //GPIO_IF_LedOff(MCU_RED_LED_GPIO);
    //GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);

    lRetVal = InitializeAppVariables();
    ASSERT_ON_ERROR(lRetVal);

    //
    // Following function configure the device to default state by cleaning
    // the persistent settings stored in NVMEM (viz. connection profiles &
    // policies, power policy etc)
    //
    // Applications may choose to skip this step if the developer is sure
    // that the device is in its default state at start of applicaton
    //
    // Note that all profiles and persistent settings that were done on the
    // device will be lost
    //
    lRetVal = ConfigureSimpleLinkToDefaultState();
    if(lRetVal < 0) {
      if (DEVICE_NOT_IN_STATION_MODE == lRetVal)
          UART_PRINT("Failed to configure the device in its default state \n\r");

      return lRetVal;
    }

    UART_PRINT("Device is configured in default state \n\r");

    CLR_STATUS_BIT_ALL(g_ulStatus);

    ///
    // Assumption is that the device is configured in station mode already
    // and it is in its default state
    //
    lRetVal = sl_Start(0, 0, 0);
    if (lRetVal < 0 || ROLE_STA != lRetVal) {
        UART_PRINT("Failed to start the device \n\r");
        return lRetVal;
    }

    UART_PRINT("Device started as STATION \n\r");

    //
    //Connecting to WLAN AP
    //
    lRetVal = WlanConnect();
    if(lRetVal < 0) {
        UART_PRINT("Failed to establish connection w/ an AP \n\r");
        //GPIO_IF_LedOn(MCU_RED_LED_GPIO);
        return lRetVal;
    }

    UART_PRINT("Connection established w/ AP and IP is aquired \n\r");
    return 0;
}


//*****************************************************************************
//
//! Main 
//!
//! \param  none
//!
//! \return None
//!
//*****************************************************************************
void main() {
    long lRetVal = -1;
    unsigned char ucDevAddr = 0x18;
    unsigned char ucRegOffset = 0x05;
    unsigned char ucRdLen = 1;
    unsigned char aucRdDataBuf[256];
    unsigned char setGRange[256];
    setGRange[0] = ucRegOffset;
    setGRange[1] = 0x08;
    //
    // Initialize board configuration
    //
    BoardInit();

    PinMuxConfig();

    InitTerm();
    ClearTerm();
    UART_PRINT("Hello world!\n\r");

    //Connect the CC3200 to the local access point
    lRetVal = connectToAccessPoint();
    //Set time so that encryption can be used
    lRetVal = set_time();
    if(lRetVal < 0) {
        UART_PRINT("Unable to set time in the device");
        LOOP_FOREVER();
    }
    //Connect to the website with TLS encryption
    lRetVal = tls_connect();
    if(lRetVal < 0) {
        ERR_PRINT(lRetVal);
    }
    I2C_IF_Open(I2C_MASTER_MODE_FST);
    I2C_IF_Write(ucDevAddr,&setGRange[0],2,1);

    http_get(lRetVal);
    int pRotate = -1;
    while(1){
        ucRegOffset = 0x05;
        I2C_IF_Write(ucDevAddr,&ucRegOffset,1,0);
        I2C_IF_Read(ucDevAddr, &aucRdDataBuf[0], ucRdLen);
        signed char xacc = -(aucRdDataBuf[0]);

        ucRegOffset = 0x03;
        I2C_IF_Write(ucDevAddr,&ucRegOffset,1,0);
        I2C_IF_Read(ucDevAddr, &aucRdDataBuf[0], ucRdLen);
        signed char yacc = (aucRdDataBuf[0]);

        long sw3 = GPIOPinRead(GPIOA1_BASE, 0x20) >> 5;
        if(sw3 == 1){
            http_get(lRetVal);
            http_post(lRetVal, 0);
            pRotate = -1;
        }

        int rotate;
        if (yacc > 30){
            rotate = 0;
        }
        else if (xacc > 30){
            rotate = 1;
        }
        else if (yacc < -30){
            rotate = 2;
        }
        else if (xacc < -30){
            rotate = 3;
        }
        else{
            if (pRotate != -1){
                rotate = pRotate;
            }
            else{
                rotate = 0;
            }
        }


        int Len = Base64decode_len(recvb64);
        char plain[Len];
        int decoded = Base64decode(plain, recvb64);
        if(rotate != pRotate){
            start_game(plain, rotate);
            http_post(lRetVal, rotate + 1);
        }
        pRotate = rotate;
    }
    sl_Stop(SL_STOP_TIMEOUT);
    LOOP_FOREVER();
}
//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

static int http_get(int iTLSSockID){
    char acSendBuff[512];
    char cCLLength[200];
    char acRecvbuff[9000];
    char* pcBufHeaders;
    int lRetVal = 0;

    pcBufHeaders = acSendBuff;
    strcpy(pcBufHeaders, GETHEADER);
    pcBufHeaders += strlen(GETHEADER);
    strcpy(pcBufHeaders, HOSTHEADER);
    pcBufHeaders += strlen(HOSTHEADER);
    strcpy(pcBufHeaders, CHEADER);
    pcBufHeaders += strlen(CHEADER);
    strcpy(pcBufHeaders, "\r\n\r\n");

    int dataLength = 0;

    strcpy(pcBufHeaders, CTHEADER);
    pcBufHeaders += strlen(CTHEADER);
    strcpy(pcBufHeaders, CLHEADER1);

    pcBufHeaders += strlen(CLHEADER1);
    sprintf(cCLLength, "%d", dataLength);

    strcpy(pcBufHeaders, cCLLength);
    pcBufHeaders += strlen(cCLLength);
    strcpy(pcBufHeaders, CLHEADER2);
    pcBufHeaders += strlen(CLHEADER2);

    //strcpy(pcBufHeaders, DATA1);
    //pcBufHeaders += strlen(DATA1);

    int testDataLength = strlen(pcBufHeaders);

    UART_PRINT(acSendBuff);


    //
    // Send the packet to the server */
    //
    lRetVal = sl_Send(iTLSSockID, acSendBuff, strlen(acSendBuff), 0);
    if(lRetVal < 0) {
        UART_PRINT("GET failed. Error Number: %i\n\r",lRetVal);
        sl_Close(iTLSSockID);
        //GPIO_IF_LedOn(MCU_RED_LED_GPIO);
        return lRetVal;
    }
    lRetVal = sl_Recv(iTLSSockID, &acRecvbuff[0], sizeof(acRecvbuff), 0);
    if(lRetVal < 0) {
        UART_PRINT("Received failed. Error Number: %i\n\r",lRetVal);
        //sl_Close(iSSLSockID);
        //GPIO_IF_LedOn(MCU_RED_LED_GPIO);
           return lRetVal;
    }
    else {
        strncpy(recvb64, acRecvbuff + 274, (5826 - 274));

