Coles427/WirelessImg/CC3200/main.c
    }

    return 0;
}

static int http_post(int iTLSSockID, int msg){
    char acSendBuff[512];
    char cCLLength[200];
    char acRecvbuff[9000];
    char* pcBufHeaders;
    int lRetVal = 0;

    pcBufHeaders = acSendBuff;
    strcpy(pcBufHeaders, POSTHEADER);
    pcBufHeaders += strlen(POSTHEADER);
    strcpy(pcBufHeaders, HOSTHEADER);
    pcBufHeaders += strlen(HOSTHEADER);
    strcpy(pcBufHeaders, CHEADER);
    pcBufHeaders += strlen(CHEADER);
    strcpy(pcBufHeaders, "\r\n\r\n");

    int dataLength = 0;

    switch(msg){
        case 0:
            dataLength = strlen(DATA0);
            break;
        case 1:
            dataLength = strlen(DATA1);;
            break;
        case 2:
            dataLength = strlen(DATA2);
            break;
        case 3:
            dataLength = strlen(DATA3);
            break;
        case 4:
            dataLength = strlen(DATA4);
            break;
        }

    strcpy(pcBufHeaders, CTHEADER);
    pcBufHeaders += strlen(CTHEADER);
    strcpy(pcBufHeaders, CLHEADER1);

    pcBufHeaders += strlen(CLHEADER1);
    sprintf(cCLLength, "%d", dataLength);

    strcpy(pcBufHeaders, cCLLength);
    pcBufHeaders += strlen(cCLLength);
    strcpy(pcBufHeaders, CLHEADER2);
    pcBufHeaders += strlen(CLHEADER2);

    switch(msg){
    case 0:
        strcpy(pcBufHeaders, DATA0);
        pcBufHeaders += strlen(DATA0);
        break;
    case 1:
        strcpy(pcBufHeaders, DATA1);
        pcBufHeaders += strlen(DATA1);
        break;
    case 2:
        strcpy(pcBufHeaders, DATA2);
        pcBufHeaders += strlen(DATA2);
        break;
    case 3:
        strcpy(pcBufHeaders, DATA3);
        pcBufHeaders += strlen(DATA3);
        break;
    case 4:
        strcpy(pcBufHeaders, DATA4);
        pcBufHeaders += strlen(DATA4);
        break;
    }


    int testDataLength = strlen(pcBufHeaders);

    UART_PRINT(acSendBuff);


    //
    // Send the packet to the server */
    //
    lRetVal = sl_Send(iTLSSockID, acSendBuff, strlen(acSendBuff), 0);
    if(lRetVal < 0) {
        UART_PRINT("POST failed. Error Number: %i\n\r",lRetVal);
        sl_Close(iTLSSockID);
        //GPIO_IF_LedOn(MCU_RED_LED_GPIO);
        return lRetVal;
    }
    lRetVal = sl_Recv(iTLSSockID, &acRecvbuff[0], sizeof(acRecvbuff), 0);
    if(lRetVal < 0) {
        UART_PRINT("Received failed. Error Number: %i\n\r",lRetVal);
        //sl_Close(iSSLSockID);
        //GPIO_IF_LedOn(MCU_RED_LED_GPIO);
           return lRetVal;
    }
    else {
        acRecvbuff[lRetVal+1] = '\0';
        UART_PRINT(acRecvbuff);
        UART_PRINT("\n\r\n\r");
    }

    return 0;
}
